
# Efinity Interface Designer SDC
# Version: 2022.2.322
# Date: 2023-06-25 15:14

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: T20Q144
# Project: K5Stack10_MIDI
# Timing Model: C3 (final)

# PLL Constraints
#################
create_clock -period 20.0000 iSCLK
create_clock -period 111.1111 iVCLK
create_clock -period 44.2478 iMCLK

# 非同期信号の場合は下記

### set_max_delay -from <source> -to <destination> <delay_value>
# 上記の構文の要素を説明します：
# -from <source>: 遅延を設定する信号の出力元（送信元）を指定します。
# -to <destination>: 遅延を受ける信号の入力先（受信先）を指定します。
# <delay_value>: 信号の最大遅延を指定します。単位は、タイムスケールに依存します（例：ns、ps）。

# set_max_delay -from [get_pins source_reg/Q] -to [get_pins dest_reg/D] 5.0
# 上記の例では、"source_reg/Q" から "dest_reg/D" への非同期信号の最大遅延を 5.0ns に設定しています。

# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAM_CE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAM_CE}]

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {iOSC_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {iOSC_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAM_LB}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAM_LB}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAM_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAM_OE}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAM_UB}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAM_UB}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAM_WE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAM_WE}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oSRAMA[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oSRAMA[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCCK_I}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCCK_I}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCCK_O}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCCK_O}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCCK_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCCK_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCSI_I}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCSI_I}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCSI_O}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCSI_O}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioCSI_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioCSI_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_I[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_I[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_O[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_O[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOL_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOL_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_I[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_I[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_O[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_O[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOR_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOR_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMISO_I}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMISO_I}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMISO_O}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMISO_O}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMISO_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMISO_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMOSI_I}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMOSI_I}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMOSI_O}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMOSI_O}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioMOSI_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioMOSI_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_I[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_I[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_O[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_O[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSRAMD_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSRAMD_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSSN_I}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSSN_I}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSSN_O}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSSN_O}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioSSN_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioSSN_OE}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {iUSB_RX}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {iUSB_RX}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {oUSB_TX}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {oUSB_TX}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[23]}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_I[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_I[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_O[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_O[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ioGPIOB_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ioGPIOB_OE[11]}]

# LVDS Tx Constraints
####################

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.144 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.053 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.347 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.347 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.347 [get_ports {jtag_inst1_RUNTEST}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.300 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.347 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.417 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]
