/**-------------------------------------------------
 * 複合リテラルサンプルプログラム
 *
 * 2020/12/20 kimura
 * Ubuntu-LTS 20.04
 * -------------------------------------------------*/
#include <stdio.h>


/**-------------------------------------------------
 * サンプル処理用に適当なメンバを用意
 * -------------------------------------------------*/
typedef struct {
	int x;
	int y;
} Point;


/**-------------------------------------------------
 * 中心点を求めて要素を返す
 * return内で複数の計算結果を返せるらしい
 * -------------------------------------------------*/
Point center(const Point *p1, const Point *p2)
{
	return (Point) {
		.x = (p1->x + p2->x) / 2,
		.y = (p1->y + p2->y) / 2
	};
}


/**-------------------------------------------------
 * 複合リテラルサンプル処理関数
 * -------------------------------------------------*/
int main(int argc, char **argv)
{
	Point p = center(&(Point){1, 2}, &(Point){2, 3});

	printf("(%d, %d)\n", p.x, p.y);

	return 0;
}
