/**-----------------------------------------------------------------------------
 * Create  2023/10/15
 * Author  kouta kimura
 * -
 * グローバル関数プロトタイプ宣言
 * 
 *-----------------------------------------------------------------------------*/

#ifndef video_func_h
#define video_func_h


/**----------------------------------------------------------------------------
 * ver1. 2023/10/20
 * 描画時のx,y座標と横縦のサイズを保存
 * SDLのRect構造体を模倣した
 *---------------------------------------------------------------------------*/
typedef struct sdl_rect
{
	int32_t x, y;
	int32_t w, h;
} SDL_Rect;


/**----------------------------------------------------------------------------
 * プロトタイプ宣言
 *---------------------------------------------------------------------------*/
void video_color_bar(void);
void video_gauge(uint32_t gauge);
void video_square_draw(SDL_Rect *sdl, uint16_t color, uint32_t adrs_id);

#endif