//----------------------------------------------------------
// Create  2022/7/16
// Author  koutakimura
// -
// RaspberryPi SPI通信 Slave動作
// 
//----------------------------------------------------------

/**----------------------------------------------------------
 * Include
 *---------------------------------------------------------*/
#include <stdio.h>
#include <bcm2835.h>


/**----------------------------------------------------------
 * main 関数
 *---------------------------------------------------------*/
int main(void)
{
	int i = 0;
	
	if (!bcm2835_init())
	{
		printf("bcm2835 not init\n");
		return 0;
	}
	printf("bcm2835 init ok\n");

	if (!bcm2835_close())
	{
		printf("bcm2835 not close\n");
		return 0;
	}

	printf("bcm2835 close ok\n");
	printf("end\n");

	return 0;
}