/**-----------------------------------------------------------------------------
 * Create  2023/07/29
 * Author  kouta kimura
 * -
 * GPIO Block function
 *-----------------------------------------------------------------------------*/
#include "../include/system_wrapper.h"

/**-----------------------------------------------------------------------------
 * I2C Read
 * FPGA のレジスタ空間に保持されている Slave I/F で取得したデータの読み込み
 *-----------------------------------------------------------------------------*/
uint8_t i2c_read(void)
{
	return usi_read_cmd(I2C_REG_SLAVE_READ_DATA) & 0xff;
}