/*------------------------------------------------------------------------------
 * Create 2024/06/15
 * Author Kouta Kimura
 * 
 *-----------------------------------------------------------------------------*/
#include "trypad.h"
#include "pico/stdlib.h"
#include "hardware/timer.h"
#include "hardware/irq.h"


/**-----------------------------------------------------------------------------
 * ファイル内 グローバル変数
 *-----------------------------------------------------------------------------*/
static bool alarm_fired = true;	// ararm 割り込み処理判定

/**-----------------------------------------------------------------------------
 * ファイル内 プロトタイプ宣言
 *-----------------------------------------------------------------------------*/
static void alarm_irq(void);


/**-----------------------------------------------------------------------------
 * clk_ref のクロック周期でカウントアップされるレジスタの値を取得
 * 
 * return TIMELR
 *-----------------------------------------------------------------------------*/
uint32_t get_time(void)
{
    return timer_hw->timelr;
}

/**-----------------------------------------------------------------------------
 * 指定時間経過したら true
 * 
 * *tmr 時間格納変数のアドレス
 * duration 経過時間の指定
 *-----------------------------------------------------------------------------*/
bool timer_compare(uint32_t *tmr, uint32_t duration)
{
	uint32_t now_t = get_time();

	if (*tmr + duration < now_t) {
		*tmr = now_t;
		return true;
	}

	return false;
}

/**----------------------------------------------------------------------------
 * 1us wait 関数
 * time 待機時間
 *---------------------------------------------------------------------------*/
void wait_us(uint32_t delay_us)
{
	busy_wait_us_32(delay_us);
}

/**----------------------------------------------------------------------------
 * 1ms wait 関数
 * time 待機時間
 *---------------------------------------------------------------------------*/
void wait_ms(uint32_t delay_ms)
{
	busy_wait_ms(delay_ms);
}

/**----------------------------------------------------------------------------
 * alarm 割込み処理の状態を取得
 *---------------------------------------------------------------------------*/
bool is_alarm_fired(void)
{
	return alarm_fired;
}

/**-----------------------------------------------------------------------------
 * Alarm 割り込み設定
 * 24-06-16 : 現時点では Alarm0 を固定使用
 *-----------------------------------------------------------------------------*/
void alarm_in_us(uint32_t delay_us)
{
    hw_set_bits(&timer_hw->inte, 1);		// Enable the interrupt for our alarm (the timer outputs 4 alarm irqs)
    irq_set_exclusive_handler(TIMER_IRQ_0, alarm_irq);	// Set irq handler for alarm irq
    irq_set_enabled(TIMER_IRQ_0, true);					// Enable the alarm irq

    uint32_t target = timer_hw->timerawl + delay_us;
    timer_hw->alarm[0] = target;
	alarm_fired = false;
}

/**-----------------------------------------------------------------------------
 * Alarm 割り込み処理
 *-----------------------------------------------------------------------------*/
static void alarm_irq(void)
{
    hw_clear_bits(&timer_hw->intr, 1);	// Clear the alarm irq
    // printf("Alarm IRQ fired\n");
    alarm_fired = true;
}